Revit 2024 API
BendingDetailCustomFieldProperties.SegmentLengthDimensionTypeId Property
 Identifies the Id of the linear dimension type which is used to show segments length.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ElementId SegmentLengthDimensionTypeId { get; set; }
Visual Basic
Public Property SegmentLengthDimensionTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ SegmentLengthDimensionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The segmentLengthDimensionTypeId should be an id of a linear dimension type.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace